app/Models/ItensModel.php

    public function getAll(){
           return $this->select('item.id,item.nome, item.preco, item.gamegenero, categoria.nome as categoria, desenvolvedora.nome as desenvolvedora, gamegenero.nome as genero')->join('categoria', 'categoria.id = item.categoria')->join('desenvolvedora', 'desenvolvedora.id = item.desenvolvedora', 'left')->join('gamegenero', 'gamegenero.id = item.gamegenero', 'left')->orderby('1 asc')->findAll();
---
SELECT `item`.`id`, `item`.`nome`, `item`.`preco`, `item`.`gamegenero`, `categoria`.`nome` as `categoria`, `desenvolvedora`.`nome` as `desenvolvedora`, `gamegenero`.`nome` as `genero`
FROM `item`
JOIN `categoria` ON `categoria`.`id` = `item`.`categoria`
LEFT JOIN `desenvolvedora` ON `desenvolvedora`.`id` = `item`.`desenvolvedora`
LEFT JOIN `gamegenero` ON `gamegenero`.`id` = `item`.`gamegenero`
ORDER BY 1 asc

    public function getAllSearch($data){
        return $this->select('item.id,item.nome, item.preco, item.gamegenero, categoria.nome as categoria, desenvolvedora.nome as desenvolvedora, gamegenero.nome as genero')->join('categoria', 'categoria.id = item.categoria')->join('desenvolvedora', 'desenvolvedora.id = item.desenvolvedora', 'left')->join('gamegenero', 'gamegenero.id = item.gamegenero', 'left')->like('item.nome', $data)->orderby('1 asc')->findAll();
---
SELECT `item`.`id`, `item`.`nome`, `item`.`preco`, `item`.`gamegenero`, `categoria`.`nome` as `categoria`, `desenvolvedora`.`nome` as `desenvolvedora`, `gamegenero`.`nome` as `genero`
FROM `item`
JOIN `categoria` ON `categoria`.`id` = `item`.`categoria`
LEFT JOIN `desenvolvedora` ON `desenvolvedora`.`id` = `item`.`desenvolvedora`
LEFT JOIN `gamegenero` ON `gamegenero`.`id` = `item`.`gamegenero`
WHERE `item`.`nome` LIKE '%Series%' ESCAPE '!'
ORDER BY 1 asc